src/InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/НаборыСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НаборыСвойств</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоНабора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonForms/РедактированиеЗначенийСвойств/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БылаНажатаКнопкаЗакрытия = Ложь;
	СсылкаНаОбъект = Параметры.Ссылка;
	
	// Получим список доступных наборов свойств
	ДоступныеНаборы = УправлениеСвойствами.ПолучитьДоступныеНаборыСвойств(Параметры.Ссылка);
	Если ТипЗнч(ДоступныеНаборы) = Тип("СписокЗначений") Тогда
		ДоступныеНаборыСвойств = ДоступныеНаборы;
	ИначеЕсли ДоступныеНаборы <> Справочники.НаборыСвойств.ПустаяСсылка() Тогда
		ДоступныеНаборыСвойств.Добавить(ДоступныеНаборы);
	КонецЕсли;
	
	// Установим заголовок
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	              НСтр("ru = 'Дополнительные сведения: %1'"), Строка(Параметры.Ссылка) );
	
	// Заполним таблицу значений свойств
	ЗаполнитьТаблицуЗначенийСвойств(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Экспорт
	
	Если ЗавершениеРаботы Тогда 
		Возврат;
	КонецЕсли;

		Если ТипЗнч(Отказ) = Тип("КодВозвратаДиалога") И Отказ = КодВозвратаДиалога.Да Тогда
			Сохранить = Истина;
		ИначеЕсли ТипЗнч(Отказ) = Тип("КодВозвратаДиалога") И (Отказ = КодВозвратаДиалога.Отмена  или Отказ = КодВозвратаДиалога.Нет) Тогда
			Сохранить = Ложь;
		КонецЕсли;
		
		Если Модифицированность И Не БылаНажатаКнопкаЗакрытия Тогда
			Если Сохранить = Неопределено Тогда
				ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытием", ЭтотОбъект, СтандартнаяОбработка), НСтр("ru = 'Значения были изменены. Сохранить?'"), РежимДиалогаВопрос.ДаНетОтмена);
				Отказ = Истина;		
			ИначеЕсли Сохранить = Истина Тогда
				Отказ = Ложь;
				ЗаписатьЗначенияСвойств();
				БылаНажатаКнопкаЗакрытия = Истина;
				Закрыть();
			ИначеЕсли Сохранить = Ложь Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененНаборСвойств" Тогда
		Если ДоступныеНаборыСвойств.НайтиПоЗначению(Параметр) <> Неопределено Тогда
			ЗаполнитьТаблицуЗначенийСвойств(Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаЗначенийСвойств

&НаКлиенте
Процедура ТаблицаЗначенийСвойствПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначенийСвойствПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначенийСвойствПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.НомерКартинки = -1 Тогда
		Отказ = Истина;
		Элемент.ТекущиеДанные.Значение = Элемент.ТекущиеДанные.ТипЗначения.ПривестиЗначение(Неопределено);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначенийСвойствПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Элемент.ПодчиненныеЭлементы.ТаблицаЗначенийСвойствЗначение.ОграничениеТипа = Элемент.ТекущиеДанные.ТипЗначения;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОКВыполнить()
	
	ЗаписатьЗначенияСвойств();
	БылаНажатаКнопкаЗакрытия = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменаВыполнить()
	
	БылаНажатаКнопкаЗакрытия = Истина;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РедактироватьСоставСвойств()
	
	Если ДоступныеНаборыСвойств.Количество() = 0 Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Для объекта нет доступных ему наборов свойств!'"));
		Возврат;
	ИначеЕсли ДоступныеНаборыСвойств.Количество() = 1 Тогда
		Элемент = ДоступныеНаборыСвойств.Получить(0);
	Иначе
		ДоступныеНаборыСвойств.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("РедактироватьСоставСвойствЗавершение", ЭтотОбъект));
        Возврат;
	КонецЕсли;
	
	РедактироватьСоставСвойствФрагмент(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСоставСвойствЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Элемент = ВыбранныйЭлемент;
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РедактироватьСоставСвойствФрагмент(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСоставСвойствФрагмент(Знач Элемент)
	
	Перем ПараметрыФормыНабораСвойств;
	
	ПараметрыФормыНабораСвойств = Новый Структура("Ключ", Элемент.Значение);
	
	ОткрытьФорму("Справочник.НаборыСвойств.Форма.ФормаЭлемента", ПараметрыФормыНабораСвойств,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

// Заполнить значениями дерево свойств
&НаСервере
Процедура ЗаполнитьТаблицуЗначенийСвойств(ИзОбработчикаПриСоздании)
	
	Если ИзОбработчикаПриСоздании Тогда
		ЗначенияСвойств = ПрочитатьЗначенияСвойствИзРегистраСведений();
	Иначе
		ЗначенияСвойств = ПолучитьТекущиеЗначенияСвойств();
		ТаблицаЗначенийСвойств.Очистить();
	КонецЕсли;
	
	Таблица = УправлениеСвойствами.ПолучитьТаблицуЗначенийСвойств(ЗначенияСвойств, ДоступныеНаборыСвойств, Истина);
	Для Каждого Стр Из Таблица Цикл
		новСтр = ТаблицаЗначенийСвойств.Добавить();
		ЗаполнитьЗначенияСвойств(новСтр, Стр);
		новСтр.НомерКартинки = ?(Стр.Удалено, 0, -1);
		
		Если Стр.Значение = Неопределено И 
			ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(Стр.ТипЗначения, Тип("Булево")) ТОгда
			новСтр.Значение = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Записать значения свойств в регистр сведений
&НаКлиенте
Процедура ЗаписатьЗначенияСвойств()
	
	ЗначенияСвойств = Новый Массив;
	
	Для Каждого Стр Из ТаблицаЗначенийСвойств Цикл
		Если ЗначениеЗаполнено(Стр.Значение) И (Стр.Значение <> Ложь) Тогда
			Значение = Новый Структура("Свойство, Значение", Стр.Свойство, Стр.Значение);
			ЗначенияСвойств.Добавить(Значение);
		КонецЕсли;
	КонецЦикла;
	
	ЗаписатьНаборСвойствВРегистр(СсылкаНаОбъект, ЗначенияСвойств);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьНаборСвойствВРегистр(Ссылка, ЗначенияСвойств)
	
	Набор = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(Ссылка);
	
	Для Каждого Стр Из ЗначенияСвойств Цикл
		Запись = Набор.Добавить();
		Запись.Свойство = Стр.Свойство;
		Запись.Значение = Стр.Значение;
		Запись.Объект   = Ссылка;
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьЗначенияСвойствИзРегистраСведений()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ   РАЗРЕШЕННЫЕ
	|	ДополнительныеСведения.Свойство,
	|	ДополнительныеСведения.Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Параметры.Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьТекущиеЗначенияСвойств()
	
	ЗначенияСвойств = Новый ТаблицаЗначений;
	ЗначенияСвойств.Колонки.Добавить("Свойство");
	ЗначенияСвойств.Колонки.Добавить("Значение");
	
	Для Каждого Стр Из ТаблицаЗначенийСвойств Цикл
		Если ЗначениеЗаполнено(Стр.Значение) И (Стр.Значение <> Ложь) Тогда
			новСтр = ЗначенияСвойств.Добавить();
			новСтр.Свойство = Стр.Свойство;
			новСтр.Значение = Стр.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначенияСвойств;
	
КонецФункции

#КонецОбласти
